# tap repositories and their packages
cask_args appdir: "/Applications"

tap "homebrew/cask-cask"
cask "maczip4win"
cask "virtualbox"
cask "visual-studio-code"
cask "macvim"
cask "osxfuse"
cask "jdownloader"
cask "iterm2"
cask "docker"
cask "clipy"
cask "flash-player"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "filezilla"
cask "java"
cask "sourcetree"
cask "bettertouchtool"
cask "skitch"
cask "android-studio"
cask "figma"
cask "macdown"

tap "homebrew/cask-versions"

tap "homebrew/core"
brew "ant"
brew "autoconf"
brew "autossh"
brew "awscli"
brew "brew-file"
brew "carthage"
brew "cask"
brew "cocoapods"
brew "composer"
brew "ffmpeg"
brew "gdbm"
brew "git-lfs"
brew "lame"
brew "libyaml"
brew "mas"
brew "nmap"
brew "ntfs-3g"
brew "openssl"
brew "openssl@1.1"
brew "pcre"
brew "perl"
brew "pkg-config"
brew "python"
brew "python@2"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "sqlite"
brew "ssh-copy-id"
brew "swiftlint"
brew "telnet"
brew "tor"
brew "vim"
brew "wget"
brew "x264"
brew "xvid"
brew "yarn"
brew "zsh"

tap "homebrew/fuse"

tap "rcmdnk/file"
brew "brew-file"

# App Store applications
mas "Evernote", id:406056744
mas "LINE", id:539883307
mas "QR Journal", id:483820530
mas "Slack", id:803453959
mas "The Unarchiver", id:425424353
mas "Xcode", id:497799835
